Бухгалтерские_задачи_по_методичке/src/Documents/Операция/Операция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Операция</name>
  <posting>Deny</posting>
  <registerRecords>AccountingRegister.Проводки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Document>

Бухгалтерские_задачи_по_методичке/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Бухгалтерские_задачи_по_методичке/src/Documents/Операция/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	ОчиститьПодразделенияПроводки();

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПодразделенияПроводки()
	Для Каждого Проводка Из Объект.Движения.Проводки Цикл
		ПустоеПодразделение = Новый (Тип("СправочникСсылка.Подразделения"));
		Проводка.ПодразделениеДт = ПустоеПодразделение;
		Проводка.ПодразделениеКт = ПустоеПодразделение;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()

	НаборЗаписей = РеквизитФормыВЗначение("Объект.Движения.Проводки");

	ДвиженияПроводки = НаборЗаписей.Выгрузить();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДвиженияПроводки.НомерСтроки,
	|	ДвиженияПроводки.ВалютаДт,
	|	ДвиженияПроводки.ВалютаКт,
	|	ДвиженияПроводки.ВалютнаяСуммаДт,
	|	ДвиженияПроводки.ВалютнаяСуммаКт,
	|	ДвиженияПроводки.Сумма
	|ПОМЕСТИТЬ ВТДвижения
	|ИЗ
	|	&ДвиженияПроводки КАК ДвиженияПроводки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДвижения.НомерСтроки,
	|	ВЫБОР
	|		КОГДА ВТДвижения.ВалютаДт = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|				КОГДА ВТДвижения.ВалютаКт = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|				ИНАЧЕ ВТДвижения.ВалютаКт
	|			КОНЕЦ
	|		ИНАЧЕ ВТДвижения.ВалютаДт
	|	КОНЕЦ КАК Валюта,
	|	ВЫБОР
	|		КОГДА ВТДвижения.ВалютнаяСуммаДт = 0
	|			ТОГДА ВЫБОР
	|				КОГДА ВТДвижения.ВалютнаяСуммаКт = 0
	|					ТОГДА 0
	|				ИНАЧЕ ВТДвижения.ВалютнаяСуммаКт
	|			КОНЕЦ
	|		ИНАЧЕ ВТДвижения.ВалютнаяСуммаДт
	|	КОНЕЦ КАК ВалютнаяСумма,
	|	ВТДвижения.Сумма
	|ПОМЕСТИТЬ ВТВалютаВДвижениях
	|ИЗ
	|	ВТДвижения КАК ВТДвижения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВалютаВДвижениях.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА КурсыВалютСрезПоследних.Кратность ЕСТЬ NULL
	|			ТОГДА ВТВалютаВДвижениях.Сумма
	|		КОГДА КурсыВалютСрезПоследних.Кратность = 0
	|			ТОГДА ВТВалютаВДвижениях.ВалютнаяСумма * КурсыВалютСрезПоследних.Курс
	|		ИНАЧЕ ВТВалютаВДвижениях.ВалютнаяСумма * КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	ВТВалютаВДвижениях КАК ВТВалютаВДвижениях
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период,) КАК КурсыВалютСрезПоследних
	|		ПО ВТВалютаВДвижениях.Валюта = КурсыВалютСрезПоследних.Валюта
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	Запрос.УстановитьПараметр("ДвиженияПроводки", ДвиженияПроводки);
	Запрос.УстановитьПараметр("Период", Объект.Дата);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = НаборЗаписей[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
		Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
	КонецЦикла;

	ЗначениеВРеквизитФормы(НаборЗаписей, "Объект.Движения.Проводки");

КонецПроцедуры

&НаКлиенте
Процедура ДвиженияПроводкиВалютаДтПриИзменении(Элемент)

	ТекДанные = Элементы.ДвиженияПроводки.ТекущиеДанные;

	Если (ЗначениеЗаполнено(ТекДанные.ВалютаДт) = Истина) Тогда

		ТекДанные.Сумма = ДвиженияПроводкиВалютаДтПриИзмененииНаСервере(
		ТекДанные.ВалютаДт, Объект.Дата, ТекДанные.ВалютнаяСуммаДт);

	ИначеЕсли (ЗначениеЗаполнено(ТекДанные.ВалютаКт) = Истина) Тогда

		ТекДанные.Сумма = ДвиженияПроводкиВалютаДтПриИзмененииНаСервере(
		ТекДанные.ВалютаКт, Объект.Дата, ТекДанные.ВалютнаяСуммаКт);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ДвиженияПроводкиВалютаДтПриИзмененииНаСервере(Валюта, Период, СуммаВалюты)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Курс,
	|	КурсыВалютСрезПоследних.Кратность
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";

	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Период", Период);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Курс = ВыборкаДетальныеЗаписи.Курс;
		Кратность = ?(ВыборкаДетальныеЗаписи.Кратность = 0, 1, ВыборкаДетальныеЗаписи.Кратность);
		Возврат СуммаВалюты * Курс / Кратность;

	КонецЦикла;

	Возврат 0;

КонецФункции
